## Python statistics essential training - 02_05_challenge

Standard imports

In [1]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

In [2]:
tb_raw = pd.read_csv('tb.csv')
tb_raw.head()

,country,year,m04,m514,m014,m1524,m2534,m3544,m4554,m5564,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [154]:
tb_final = pd.read_csv('final.csv')
print(tb_final.shape)
tb_final.head()

(35750, 5)

  country  year    age sex  cases
0      AD  1996  15-24   f    1.0
1      AD  1996  15-24   m    0.0
2      AD  1996  25-34   f    1.0
3      AD  1996  25-34   m    0.0
4      AD  1996  35-44   f    0.0

In [153]:
tb_final[tb_final.age=='0-4']

      country  year  age sex  cases
101        AD  2005  0-4   f    0.0
102        AD  2005  0-4   m    0.0
121        AD  2006  0-4   f    0.0
122        AD  2006  0-4   m    0.0
143        AD  2008  0-4   f    0.0
...       ...   ...  ...  ..    ...
35283      ZA  2007  0-4   m  340.0
35300      ZA  2008  0-4   f  298.0
35301      ZA  2008  0-4   m  344.0
35518      ZW  2007  0-4   f    7.0
35519      ZW  2007  0-4   m    6.0

[785 rows x 5 columns]

In [11]:
tb_final.age.unique()

array(['15-24', '25-34', '35-44', '45-54', '55-64', '65+', nan, '0-4',
       '5-14'], dtype=object)

In [5]:
tb_raw.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [20]:
for i in tb_raw.columns.str.contains('m'):
    print(i.index)

AttributeError: 'numpy.bool_' object has no attribute 'index'

In [135]:
#create a list for all male columns
tb_mcol = ['country', 'year']

#instantiate counter for loop
i=0

#add to list all the male column names
for col in tb_raw.columns.str.contains('m'):
    if col == True:
        tb_mcol.append(tb_raw.columns[i])
    i += 1

print(tb_mcol)

['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564', 'm65', 'mu']

In [136]:
tb_m = tb_raw[tb_mcol].fillna('0.0')
tb_m.head()

  country  year  m04 m514 m014 m1524 m2534 m3544 m4554 m5564  m65   mu
0      AD  1989  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  0.0  0.0
1      AD  1990  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  0.0  0.0
2      AD  1991  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  0.0  0.0
3      AD  1992  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  0.0  0.0
4      AD  1993  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  0.0  0.0

In [137]:
tb_mcol.remove('country')
tb_mcol.remove('year')
print(tb_mcol)

['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564', 'm65', 'mu']

In [138]:
tb_mmelt = tb_m.melt(['country', 'year'], tb_mcol, 'age', 'cases')
tb_mmelt.sample(5)

      country  year    age cases
14804      MH  1996   m014     7
47933      GA  1994    m65   0.0
44477      PF  1994  m5564   0.0
15281      NE  1980   m014   0.0
12031      BF  1999   m014    13

In [139]:
print(tb_mmelt.shape)
tb_mmelt.head()

(57690, 4)

  country  year  age cases
0      AD  1989  m04   0.0
1      AD  1990  m04   0.0
2      AD  1991  m04   0.0
3      AD  1992  m04   0.0
4      AD  1993  m04   0.0

In [128]:
tb_mmelt.age.unique()

array(['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564',
       'm65', 'mu'], dtype=object)

In [129]:
tb_final.age.unique()

array(['15-24', '25-34', '35-44', '45-54', '55-64', '65+', nan, '0-4',
       '5-14'], dtype=object)

In [140]:
tb_mp = tb_mmelt.copy()

In [141]:
tb_mp['sex'] = tb_mp['age'].apply(lambda s: s[0])

In [142]:
def age_group(s):
    if len(s)==2:
        return '65+'
    elif len(s)==3:
        return s[1]+'-'+s[2]
    elif len(s)==4:
        return s[1]+'-'+s[2:4]
    elif len(s)==5:
        return s[1:3]+'-'+s[3:5]

In [143]:
tb_mp['age'] = tb_mp.age.apply(lambda s: age_group(s))

  country  year  age cases sex
0      AD  1989  0-4   0.0   m
1      AD  1990  0-4   0.0   m
2      AD  1991  0-4   0.0   m
3      AD  1992  0-4   0.0   m
4      AD  1993  0-4   0.0   m

In [144]:
tb_mp.age.unique()

array(['0-4', '5-14', '0-14', '15-24', '25-34', '35-44', '45-54', '55-64',
       '6-5', '65+'], dtype=object)